---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetProperty.Dispose
source: html/dc1aefa4-7c91-64e4-edc0-27e1cadeacc1.htm
---
# Autodesk.Revit.DB.Visual.AssetProperty.Dispose Method

Releases all resources used by the AssetProperty

## Syntax (C#)
```csharp
public void Dispose()
```